{
  "id": "OSEC-2019-02",
  "published": "2019-04-26T00:00:00",
  "modified": "2026-01-13T12:00:00",
  "details": "## Background\n\nMirageOS is a library operating system using cooperative multitasking, which can be executed as a guest of the Xen hypervisor. Virtual machines running on a Xen host can communicate by sharing pages of memory. For example, when a Mirage VM wants to use a virtual network device provided by a Linux dom0:\n\n1. The Mirage VM reserves some of its memory for this purpose and writes an entry to its grant table to say that dom0 should have access to it.\n2. The Mirage VM tells dom0 (via XenStore) about the grant.\n3. dom0 asks Xen to map the memory into its address space.\n\nThe Mirage VM and dom0 can now communicate using this shared memory. When dom0 has finished with the memory:\n\n1. dom0 tells Xen to unmap the memory from its address space.\n2. dom0 tells the Mirage VM that it no longer needs the memory.\n3. The Mirage VM removes the entry from its grant table.\n4. The Mirage VM may reuse the memory for other purposes.\n\n## Problem Description\n\nMirage removes the entry by calling the gnttab_end_access function in Mini-OS. This function checks whether the remote domain still has the memory mapped. If so, it returns 0 to indicate that the entry cannot be removed yet. To make this function available to OCaml code, the stub_gntshr_end_access C stub in mirage-xen wrapped this with the OCaml calling conventions. Unfortunately, it ignored the return code and reported success in all cases.\n\n## Impact\n\nA malicious VM can tell a MirageOS unikernel that it has finished using some shared memory while it is still mapped. The Mirage unikernel will think that the unshare operation has succeeded and may reuse the memory, or allow it to be garbage collected. The malicious VM will still have access to the memory.\n\nIn many cases (such as in the example above) the remote domain will be dom0, which is already fully trusted. However, if a unikernel shares memory with an untrusted domain then there is a problem.\n\n## Solution\n\nReturning the result from the C stub required changes to the OCaml grant API to deal with the result. This turned out to be difficult because, for historical reasons, the OCaml part of the API was in the ocaml-gnt package while the C stubs were in mirage-xen, and because the C stubs are also shared with the Unix backend.\n\nWe instead created a new grant API in mirage-xen, migrated all existing Mirage drivers to use it, and then dropped support for the old API. mirage-xen 3.3.0 added support for the new API and 3.4.0 removed support for the old one.",
  "summary": "Grant unshare vulnerability in mirage-xen",
  "severity": [
    {
      "type": "CVSS_V3",
      "score": "CVSS:3.0/AV:L/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:N"
    }
  ],
  "repo_url": "https://github.com/mirage/mirage-xen",
  "cwes": [],
  "commits": [
    "f5bcd1b79f76ba32d9d22e169438a74928b2f286"
  ]
}
